Revit 2017 API
Plane Constructor (XYZ, XYZ)
 Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByNormalAndOrigin() instead.")]
public Plane(
	XYZ norm,
	XYZ origin
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByNormalAndOrigin() instead.")> _
Public Sub New ( _
	norm As XYZ, _
	origin As XYZ _
)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Please use Plane.CreateByNormalAndOrigin() instead.")]
public:
Plane(
	XYZ^ norm,
	XYZ^ origin
)
Parameters
norm
Type: Autodesk.Revit.DB.XYZ
 Plane normal.
origin
Type: Autodesk.Revit.DB.XYZ
 Plane origin.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Plane Class
Plane Overload
Autodesk.Revit.DB Namespace